Repository: stcarrez/ada-keystore
Catalog: po/*.po
Languages: fr

source: Available subcommands:
fr: Commandes disponibles:

source: Block
fr: Bloc

source: Type '{0} help {command}' for help on a specific command.
fr: Tapez '{0} help {command}' pour l'aide d'une commande spécifique.

source: '{0}' does not exist
fr: '{0}' n'existe pas

source: '{0}' is not a regular file nor a directory
fr: '{0}' n'est pas un fichier ni un répertoire

source: add a password
fr: ajouter un mot de passe

source: akt - tool to store and protect your sensitive data
fr: akt - outil pour stocker et protéger vos données sensibles

source: akt: enter account name (<issuer>:<name>)
fr: akt: entrez le nom du compte (<issuer>:<nom>)

source: akt: number of digits (5..8, default 6)
fr: akt: nombre de digits (5..8, défaut 6)

source: akt: secret key (base32)
fr: akt: clef secrète (base32)

source: algorithm '{0}' is not supported
fr: l'algorithme '{0}' n'est pas supporté

source: Allow the kernel to cache data from this file system
fr: Permettre au noyau de cacher les données pour ce système de fichiers

source: cannot access file: {0}
fr: impossible d'accéder au fichier: {0}

source: cannot create file for the editor
fr: impossible de créer un fichier pour l'éditeur

source: cannot execute editor '{0}'
fr: impossible de lancer l'éditeur '{0}'

source: cannot open keystore '{0}': {1}
fr: impossible d'ouvrir le fichier '{0}': {1}

source: cannot read the editor's output
fr: impossible de lire la sortie de l'éditeur

source: cannot run in background
fr: impossible de lancer l'execution en tache de fond

source: cannot set the permission of {0}
fr: impossible de définir l'autorisation de {0}

source: change the password
fr: changer le mot de passe

source: counters must be positive integers
fr: les compteurs doivent être des entiers positifs.

source: create the keystore
fr: créer le magasin de clés

source: Define the editor command to use
fr: Définir la commande d'éditeur à utiliser

source: Defines the key slot to erase in range 1..7
fr: Définit l'emplacement de la clé à effacer 1..7

source: Defines the path for akt global configuration
fr: Définit le chemin du fichier global de configuration d'akt

source: Defines the path for the keystore file
fr: Définit le chemin du fichier de clés

source: Do not output the trailing newline
fr: Ne pas afficher le retour à la ligne

source: edit the value with an external editor
fr: éditer la valeur avec un éditeur externe

source: editor exited with status{0}
fr: L'éditeur a quitté avec le statut{0}

source: Enable debug dump execution
fr: Activer l'exécution du débogage avec dump

source: Enable debug execution
fr: Activer l'exécution du débogage

source: Enable debug output of fuse library
fr: Activer l'execution du débogage de la librairie fuse

source: Enter password:
fr: Mot de passe:

source: Entry count:
fr: Nombre d'entrées:

source: Erase and fill with zeros instead of random values
fr: Effacer et remplir avec des zéros au lieu de valeurs aléatoires

source: Extract
fr: Extraction

source: Force erase of password used to unlock the keystore
fr: Forcer l'effacement du mot de passe utilisé pour déverrouiller le magasin de clés

source: Force the creation of the keystore
fr: Forcer la création du magasin de clés

source: Force update of existing otpauth URI
fr: Forcer la mise à jour de l'entrée otpauth existante

source: generate a one time password or manage OATH secrets
fr: générer un mot de passe à usage unique ou gérer les secrets OATH

source: generate or manage named keys
fr: génération et gestion des clefs nommées

source: get a value from the keystore
fr: obtenir une valeur du magasin de clés

source: get or set global options
fr: obtenir ou configurer une option global

source: insert or update a value in the keystore
fr: insérer ou mettre à jour une valeur dans le magasin de clés

source: Interactive insertion of otpauth
fr: Ajout interactif d'une définition otpauth

source: invalid account name
fr: le compte n'est pas valide

source: Invalid command
fr: command invalide

source: invalid counter range: {0}
fr: plage de compteur non valide: {0}

source: invalid digits '{0}'
fr: digits invalid '{0}'

source: invalid key slot number: it must be a number in range 1..7
fr: numéro de l'emplacement de clé non valide: il doit s'agir d'un numéro compris dans la plage 1..7

source: invalid keystore file '{0}': {1}
fr: fichier de clés invalide '{0}': {1}

source: invalid or truncated keystore file '{0}': size is incorrect
fr: fichier de clés invalide ou tronqué '{0}': la taille est incorrecte

source: invalid otpauth URI: missing '{0}'
fr: URI otpauth invalide: il manque '{0}'

source: invalid password to unlock the keystore file
fr: mot de passe invalide pour déverrouiller le fichier de clés

source: invalid period '{0}'
fr: period invalide '{0}'

source: invalid secret key
fr: clef secrète invalide

source: invalid secret key for '{0}'
fr: clef secrète invalide pour '{0}'

source: key '{0}' is already defined
fr: la clef '{0}' est déjà définie

source: Key slots used:
fr: Nombre de clefs utilisées:

source: list values of the keystore
fr: lister les valeurs du magasin de clés

source: missing command name to execute.
fr: nom de commande manquant à exécuter.

source: missing file or directory to extract
fr: nom du fichier ou répertoire à extraire manquant

source: missing GPG user name
fr: nom de l'identifiant GPG manquant

source: missing name and value to set
fr: manque le nom et la valeur

source: missing name to store the standard input
fr: manque le nom pour sauver l'entrée standard

source: missing option parameter
fr: paramètre d'option manquant

source: missing the keystore file name
fr: manque le nom de fichier du magasin de clés

source: missing value name to remove
fr: manque le nom à supprimer

source: mount the keystore on the filesystem for a direct access
fr: monter le magasin de clés sur le système de fichier pour un accès direct

source: Name
fr: Nom

source: New password:
fr: Nouveau mot de passe:

source: no content for an item of type wallet
fr: pas de contenu pour une entrée de type wallet

source: no otpauth matching account '{0}'
fr: pas de otpauth correspondant au compte '{0}'

source: no valid directory keys can be created
fr: pas de répertoire de clef pouvant être créé

source: Number of threads for the encryption/decryption process
fr: Nombre de threads pour le processus de cryptage/décryptage

source: only 'totp' otpauth URI is supported
fr: seul le format 'totp' est supporté pour les URI otpauth

source: override existing otpauth entry ?
fr: écraser l'entrée otpauth existante ?

source: password file does not exist
fr: le fichier de mot de passe n'existe pas

source: password file is not safe
fr: le fichier de mot de passe n'est pas sûr

source: password is empty
fr: le mot de passe est vide

source: password is too big
fr: le mot de passe est trop long

source: print some help
fr: afficher de l'aide

source: Print the version
fr: Afficher la version

source: Read the environment variable that contains the password (not safe)
fr: Lire la variable d’'environnement contenant le mot de passe (non sécurisé)

source: Read the file that contains the password
fr: Lire un fichier contenant le mot de passe

source: Read the file that contains the wallet keys
fr: Lire un fichier contenant le mot de passe

source: Read the password from the pipe with the given file descriptor
fr: Lire le mot de passe du tube avec le descripteur de fichier donné

source: read the standard input and insert or update the content in the keystore
fr: lire l'entrée standard et insérer ou mettre à jour le contenu dans le magasin de clés

source: refusing to erase the key slot used by current password
fr: refus d'éffacer la clé utilisée par le mot de passe actuel

source: remove a password
fr: supprimer un mot de passe

source: Remove the named key
fr: Supprime la clef nommée

source: Remove the otpauth URI
fr: Supprime l'URI otpauth

source: remove values from the keystore
fr: supprimer les valeurs du magasin de clés

source: report information about the keystore
fr: donner des informations sur le magasin de clés

source: Run as foreground (no daemonize)
fr: Lancer la commande en premier plan (no daemonize)

source: Run the command to get the password
fr: Exécuter la commande pour obtenir le mot de passe

source: Run the ssh-askpass command to get the password
fr: Exécuter la commande ssh-askpass pour obtenir le mot de passe

source: Set the range for the PBKDF2 counter
fr: Définir la plage pour le compteur PBKDF2

source: Size
fr: Taille

source: some internal error occurred
fr: une erreur interne est survenue

source: split counter is invalid or out of range: {0}
fr: le compteur de fractionnement est invalide ou hors limites: {0}

source: Split the data blocks in COUNT separate files
fr: Scinder les blocs de données en COUNT fichiers séparés

source: Store the result in the output file or directory
fr: Stocker le résultat dans le fichier ou le répertoire de sortie

source: The directory which contains the keystore data blocks
fr: Le répertoire contenant les blocs de données du magasin de clés

source: the file is not a keystore
fr: le fichier n'est pas un magasin de clés

source: the keystore file is corrupted: invalid data block headers or signature
fr: le fichier de clés est corrompu: en-têtes de blocs de données non valides ou signature invalide

source: the keystore file is corrupted: invalid meta data content
fr: le fichier de clés est corrompu: contenu de métadonnées non valide

source: the keystore file is corrupted: invalid or missing storage file
fr: le fichier de clés est corrompu: fichier de stockage non valide ou manquant

source: the keystore file is corrupted: invalid signature
fr: le fichier de clés est corrompu: signature invalide

source: the min counter is greater than max counter
fr: le compteur mini est supérieur au compteur max

source: The password is passed within the command line (not safe)
fr: Le mot de passe est passé dans la ligne de commande (non sécurisé)

source: The password is passed within the socket connection
fr: Le mot de passe est passé dans la connexion socket

source: The password is read from a key file
fr: Le mot de passe est lu à partir d'une clef nommée

source: The password was successfully removed.
fr: Le mot de passe a été supprimé avec succès.

source: The wallet master key is read from a named key file
fr: Le mot de passe est lu à partir d'une clef nommée

source: there is no available key slot to add the password
fr: il n'y a pas de slot de clé disponible pour ajouter le mot de passe

source: unknown command '{0}'
fr: command inconnue '{0}'

source: Use gpg to protect the keystore access
fr: Utiliser gpg pour protéger l'accès au magasin de clés

source: use the --force option if you really want to erase this slot
fr: utilisez l'option --force si vous voulez vraiment effacer cet emplacement

source: Use the standard input to read the content
fr: Lire l'entrée standard et insérer ou mettre à jour le contenu dans le magasin de clés

source: valid format are 'MAX_COUNTER' or 'MIN_COUNTER:MAX_COUNTER'
fr: les formats valides sont 'MAX_COUNTER' ou 'MIN_COUNTER:MAX_COUNTER'

source: value '{0}' not found
fr: la valeur '{0}' est introuvable

source: value is out of range
fr: la valeur est en dehors des limites

source: Verbose execution mode
fr: Mode d'exécution détaillé

source: [-V] [-v] [-vv] [-vvv] [-c path] [-t count] [-z] <command> [<args>] where: -V Print the tool version -v Verbose execution mode -vv Debug execution mode -vvv Dump execution mode -c path Defines the path for akt global configuration -t count Number of threads for the encryption/decryption process -z Erase and fill with zeros instead of random values
fr: [-V] [-v] [-vv] [-vvv] [-c path] [-t count] [-z] <command> [<args>] où: -V Afficher la version de l'outil -v Mode d'execution verbeux -vv Mode d'execution debug -vvv Mode d'execution dump -c path Définit le chemin du fichier de configuration global d'akt -t count Nombre de threads pour le processus de cryptage/décryptage -z Effacer et remplir avec des zéros au lieu de valeurs aléatoires
